Revit 2027 API
ExportLineweightTable.Add Method
 Inserts a (key, info) pair into Export line weight table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Add(
	ExportLineweightKey exportLineweightKey,
	ExportLineweightInfo exportLineweightInfo
)
Public Sub Add (
	exportLineweightKey As ExportLineweightKey,
	exportLineweightInfo As ExportLineweightInfo
)
public:
void Add(
	ExportLineweightKey^ exportLineweightKey,
	ExportLineweightInfo^ exportLineweightInfo
)
member Add :
        exportLineweightKey : ExportLineweightKey *
        exportLineweightInfo : ExportLineweightInfo -> unit
Parameters
exportLineweightKey ExportLineweightKey
 The export line weight Key to be added.
exportLineweightInfo ExportLineweightInfo
 The export line weight info to be added.
Exceptions
Exception | Condition
ArgumentException |  The key already exists in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace